espressif/esp-idf/components/soc/esp32p4/include/soc/otp_debug_reg.h
/** OTP_DEBUG_BLK0_BACKUP3_W3_REG register
 *  Otp debuger block0 data register14.
 */
#define OTP_DEBUG_BLK0_BACKUP3_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x34)
/** OTP_DEBUG_BLOCK0_BACKUP3_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup3 word3 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP3_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W3_M  (OTP_DEBUG_BLOCK0_BACKUP3_W3_V << OTP_DEBUG_BLOCK0_BACKUP3_W3_S)
#define OTP_DEBUG_BLOCK0_BACKUP3_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W3_S  0

/** OTP_DEBUG_BLK0_BACKUP3_W4_REG register
 *  Otp debuger block0 data register15.
 */
#define OTP_DEBUG_BLK0_BACKUP3_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x38)
/** OTP_DEBUG_BLOCK0_BACKUP3_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup3 word4 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP3_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W4_M  (OTP_DEBUG_BLOCK0_BACKUP3_W4_V << OTP_DEBUG_BLOCK0_BACKUP3_W4_S)
#define OTP_DEBUG_BLOCK0_BACKUP3_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W4_S  0

/** OTP_DEBUG_BLK0_BACKUP3_W5_REG register
 *  Otp debuger block0 data register16.
 */
#define OTP_DEBUG_BLK0_BACKUP3_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x3c)
/** OTP_DEBUG_BLOCK0_BACKUP3_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup3 word5 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP3_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W5_M  (OTP_DEBUG_BLOCK0_BACKUP3_W5_V << OTP_DEBUG_BLOCK0_BACKUP3_W5_S)
#define OTP_DEBUG_BLOCK0_BACKUP3_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP3_W5_S  0

/** OTP_DEBUG_BLK0_BACKUP4_W1_REG register
 *  Otp debuger block0 data register17.
 */
#define OTP_DEBUG_BLK0_BACKUP4_W1_REG (DR_REG_OTP_DEBUG_BASE + 0x40)
/** OTP_DEBUG_BLOCK0_BACKUP4_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup4 word1 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP4_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W1_M  (OTP_DEBUG_BLOCK0_BACKUP4_W1_V << OTP_DEBUG_BLOCK0_BACKUP4_W1_S)
#define OTP_DEBUG_BLOCK0_BACKUP4_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W1_S  0

/** OTP_DEBUG_BLK0_BACKUP4_W2_REG register
 *  Otp debuger block0 data register18.
 */
#define OTP_DEBUG_BLK0_BACKUP4_W2_REG (DR_REG_OTP_DEBUG_BASE + 0x44)
/** OTP_DEBUG_BLOCK0_BACKUP4_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup4 word2 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP4_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W2_M  (OTP_DEBUG_BLOCK0_BACKUP4_W2_V << OTP_DEBUG_BLOCK0_BACKUP4_W2_S)
#define OTP_DEBUG_BLOCK0_BACKUP4_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W2_S  0

/** OTP_DEBUG_BLK0_BACKUP4_W3_REG register
 *  Otp debuger block0 data register19.
 */
#define OTP_DEBUG_BLK0_BACKUP4_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x48)
/** OTP_DEBUG_BLOCK0_BACKUP4_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup4 word3 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP4_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W3_M  (OTP_DEBUG_BLOCK0_BACKUP4_W3_V << OTP_DEBUG_BLOCK0_BACKUP4_W3_S)
#define OTP_DEBUG_BLOCK0_BACKUP4_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W3_S  0

/** OTP_DEBUG_BLK0_BACKUP4_W4_REG register
 *  Otp debuger block0 data register20.
 */
#define OTP_DEBUG_BLK0_BACKUP4_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x4c)
/** OTP_DEBUG_BLOCK0_BACKUP4_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup4 word4 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP4_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W4_M  (OTP_DEBUG_BLOCK0_BACKUP4_W4_V << OTP_DEBUG_BLOCK0_BACKUP4_W4_S)
#define OTP_DEBUG_BLOCK0_BACKUP4_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W4_S  0

/** OTP_DEBUG_BLK0_BACKUP4_W5_REG register
 *  Otp debuger block0 data register21.
 */
#define OTP_DEBUG_BLK0_BACKUP4_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x50)
/** OTP_DEBUG_BLOCK0_BACKUP4_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block0 backup4 word5 data.
 */
#define OTP_DEBUG_BLOCK0_BACKUP4_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W5_M  (OTP_DEBUG_BLOCK0_BACKUP4_W5_V << OTP_DEBUG_BLOCK0_BACKUP4_W5_S)
#define OTP_DEBUG_BLOCK0_BACKUP4_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK0_BACKUP4_W5_S  0

/** OTP_DEBUG_BLK1_W1_REG register
 *  Otp debuger block1 data register1.
 */
#define OTP_DEBUG_BLK1_W1_REG (DR_REG_OTP_DEBUG_BASE + 0x54)
/** OTP_DEBUG_BLOCK1_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word1 data.
 */
#define OTP_DEBUG_BLOCK1_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W1_M  (OTP_DEBUG_BLOCK1_W1_V << OTP_DEBUG_BLOCK1_W1_S)
#define OTP_DEBUG_BLOCK1_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W1_S  0

/** OTP_DEBUG_BLK1_W2_REG register
 *  Otp debuger block1 data register2.
 */
#define OTP_DEBUG_BLK1_W2_REG (DR_REG_OTP_DEBUG_BASE + 0x58)
/** OTP_DEBUG_BLOCK1_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word2 data.
 */
#define OTP_DEBUG_BLOCK1_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W2_M  (OTP_DEBUG_BLOCK1_W2_V << OTP_DEBUG_BLOCK1_W2_S)
#define OTP_DEBUG_BLOCK1_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W2_S  0

/** OTP_DEBUG_BLK1_W3_REG register
 *  Otp debuger block1 data register3.
 */
#define OTP_DEBUG_BLK1_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x5c)
/** OTP_DEBUG_BLOCK1_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word3 data.
 */
#define OTP_DEBUG_BLOCK1_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W3_M  (OTP_DEBUG_BLOCK1_W3_V << OTP_DEBUG_BLOCK1_W3_S)
#define OTP_DEBUG_BLOCK1_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W3_S  0

/** OTP_DEBUG_BLK1_W4_REG register
 *  Otp debuger block1 data register4.
 */
#define OTP_DEBUG_BLK1_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x60)
/** OTP_DEBUG_BLOCK1_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word4 data.
 */
#define OTP_DEBUG_BLOCK1_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W4_M  (OTP_DEBUG_BLOCK1_W4_V << OTP_DEBUG_BLOCK1_W4_S)
#define OTP_DEBUG_BLOCK1_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W4_S  0

/** OTP_DEBUG_BLK1_W5_REG register
 *  Otp debuger block1 data register5.
 */
#define OTP_DEBUG_BLK1_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x64)
/** OTP_DEBUG_BLOCK1_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word5 data.
 */
#define OTP_DEBUG_BLOCK1_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W5_M  (OTP_DEBUG_BLOCK1_W5_V << OTP_DEBUG_BLOCK1_W5_S)
#define OTP_DEBUG_BLOCK1_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W5_S  0

/** OTP_DEBUG_BLK1_W6_REG register
 *  Otp debuger block1 data register6.
 */
#define OTP_DEBUG_BLK1_W6_REG (DR_REG_OTP_DEBUG_BASE + 0x68)
/** OTP_DEBUG_BLOCK1_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block1  word6 data.
 */
#define OTP_DEBUG_BLOCK1_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W6_M  (OTP_DEBUG_BLOCK1_W6_V << OTP_DEBUG_BLOCK1_W6_S)
#define OTP_DEBUG_BLOCK1_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK1_W6_S  0

