espressif/esp-idf/components/soc/esp32p4/include/soc/otp_debug_reg.h
/** OTP_DEBUG_BLK3_W3_REG register
 *  Otp debuger block3 data register3.
 */
#define OTP_DEBUG_BLK3_W3_REG (DR_REG_OTP_DEBUG_BASE + 0xac)
/** OTP_DEBUG_BLOCK3_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word3 data.
 */
#define OTP_DEBUG_BLOCK3_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W3_M  (OTP_DEBUG_BLOCK3_W3_V << OTP_DEBUG_BLOCK3_W3_S)
#define OTP_DEBUG_BLOCK3_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W3_S  0

/** OTP_DEBUG_BLK3_W4_REG register
 *  Otp debuger block3 data register4.
 */
#define OTP_DEBUG_BLK3_W4_REG (DR_REG_OTP_DEBUG_BASE + 0xb0)
/** OTP_DEBUG_BLOCK3_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word4 data.
 */
#define OTP_DEBUG_BLOCK3_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W4_M  (OTP_DEBUG_BLOCK3_W4_V << OTP_DEBUG_BLOCK3_W4_S)
#define OTP_DEBUG_BLOCK3_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W4_S  0

/** OTP_DEBUG_BLK3_W5_REG register
 *  Otp debuger block3 data register5.
 */
#define OTP_DEBUG_BLK3_W5_REG (DR_REG_OTP_DEBUG_BASE + 0xb4)
/** OTP_DEBUG_BLOCK3_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word5 data.
 */
#define OTP_DEBUG_BLOCK3_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W5_M  (OTP_DEBUG_BLOCK3_W5_V << OTP_DEBUG_BLOCK3_W5_S)
#define OTP_DEBUG_BLOCK3_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W5_S  0

/** OTP_DEBUG_BLK3_W6_REG register
 *  Otp debuger block3 data register6.
 */
#define OTP_DEBUG_BLK3_W6_REG (DR_REG_OTP_DEBUG_BASE + 0xb8)
/** OTP_DEBUG_BLOCK3_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word6 data.
 */
#define OTP_DEBUG_BLOCK3_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W6_M  (OTP_DEBUG_BLOCK3_W6_V << OTP_DEBUG_BLOCK3_W6_S)
#define OTP_DEBUG_BLOCK3_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W6_S  0

/** OTP_DEBUG_BLK3_W7_REG register
 *  Otp debuger block3 data register7.
 */
#define OTP_DEBUG_BLK3_W7_REG (DR_REG_OTP_DEBUG_BASE + 0xbc)
/** OTP_DEBUG_BLOCK3_W7 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word7 data.
 */
#define OTP_DEBUG_BLOCK3_W7    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W7_M  (OTP_DEBUG_BLOCK3_W7_V << OTP_DEBUG_BLOCK3_W7_S)
#define OTP_DEBUG_BLOCK3_W7_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W7_S  0

/** OTP_DEBUG_BLK3_W8_REG register
 *  Otp debuger block3 data register8.
 */
#define OTP_DEBUG_BLK3_W8_REG (DR_REG_OTP_DEBUG_BASE + 0xc0)
/** OTP_DEBUG_BLOCK3_W8 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word8 data.
 */
#define OTP_DEBUG_BLOCK3_W8    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W8_M  (OTP_DEBUG_BLOCK3_W8_V << OTP_DEBUG_BLOCK3_W8_S)
#define OTP_DEBUG_BLOCK3_W8_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W8_S  0

/** OTP_DEBUG_BLK3_W9_REG register
 *  Otp debuger block3 data register9.
 */
#define OTP_DEBUG_BLK3_W9_REG (DR_REG_OTP_DEBUG_BASE + 0xc4)
/** OTP_DEBUG_BLOCK3_W9 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word9 data.
 */
#define OTP_DEBUG_BLOCK3_W9    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W9_M  (OTP_DEBUG_BLOCK3_W9_V << OTP_DEBUG_BLOCK3_W9_S)
#define OTP_DEBUG_BLOCK3_W9_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W9_S  0

/** OTP_DEBUG_BLK3_W10_REG register
 *  Otp debuger block3 data register10.
 */
#define OTP_DEBUG_BLK3_W10_REG (DR_REG_OTP_DEBUG_BASE + 0xc8)
/** OTP_DEBUG_BLOCK3_W10 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word10 data.
 */
#define OTP_DEBUG_BLOCK3_W10    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W10_M  (OTP_DEBUG_BLOCK3_W10_V << OTP_DEBUG_BLOCK3_W10_S)
#define OTP_DEBUG_BLOCK3_W10_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W10_S  0

/** OTP_DEBUG_BLK3_W11_REG register
 *  Otp debuger block3 data register11.
 */
#define OTP_DEBUG_BLK3_W11_REG (DR_REG_OTP_DEBUG_BASE + 0xcc)
/** OTP_DEBUG_BLOCK3_W11 : RO; bitpos: [31:0]; default: 0;
 *  Otp block3 word11 data.
 */
#define OTP_DEBUG_BLOCK3_W11    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W11_M  (OTP_DEBUG_BLOCK3_W11_V << OTP_DEBUG_BLOCK3_W11_S)
#define OTP_DEBUG_BLOCK3_W11_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK3_W11_S  0

/** OTP_DEBUG_BLK4_W1_REG register
 *  Otp debuger block4 data register1.
 */
#define OTP_DEBUG_BLK4_W1_REG (DR_REG_OTP_DEBUG_BASE + 0xd0)
/** OTP_DEBUG_BLOCK4_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word1 data.
 */
#define OTP_DEBUG_BLOCK4_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W1_M  (OTP_DEBUG_BLOCK4_W1_V << OTP_DEBUG_BLOCK4_W1_S)
#define OTP_DEBUG_BLOCK4_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W1_S  0

/** OTP_DEBUG_BLK4_W2_REG register
 *  Otp debuger block4 data register2.
 */
#define OTP_DEBUG_BLK4_W2_REG (DR_REG_OTP_DEBUG_BASE + 0xd4)
/** OTP_DEBUG_BLOCK4_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word2 data.
 */
#define OTP_DEBUG_BLOCK4_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W2_M  (OTP_DEBUG_BLOCK4_W2_V << OTP_DEBUG_BLOCK4_W2_S)
#define OTP_DEBUG_BLOCK4_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W2_S  0

/** OTP_DEBUG_BLK4_W3_REG register
 *  Otp debuger block4 data register3.
 */
#define OTP_DEBUG_BLK4_W3_REG (DR_REG_OTP_DEBUG_BASE + 0xd8)
/** OTP_DEBUG_BLOCK4_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word3 data.
 */
#define OTP_DEBUG_BLOCK4_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W3_M  (OTP_DEBUG_BLOCK4_W3_V << OTP_DEBUG_BLOCK4_W3_S)
#define OTP_DEBUG_BLOCK4_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W3_S  0

/** OTP_DEBUG_BLK4_W4_REG register
 *  Otp debuger block4 data register4.
 */
#define OTP_DEBUG_BLK4_W4_REG (DR_REG_OTP_DEBUG_BASE + 0xdc)
/** OTP_DEBUG_BLOCK4_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word4 data.
 */
#define OTP_DEBUG_BLOCK4_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W4_M  (OTP_DEBUG_BLOCK4_W4_V << OTP_DEBUG_BLOCK4_W4_S)
#define OTP_DEBUG_BLOCK4_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W4_S  0

/** OTP_DEBUG_BLK4_W5_REG register
 *  Otp debuger block4 data register5.
 */
#define OTP_DEBUG_BLK4_W5_REG (DR_REG_OTP_DEBUG_BASE + 0xe0)
/** OTP_DEBUG_BLOCK4_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word5 data.
 */
#define OTP_DEBUG_BLOCK4_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W5_M  (OTP_DEBUG_BLOCK4_W5_V << OTP_DEBUG_BLOCK4_W5_S)
#define OTP_DEBUG_BLOCK4_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W5_S  0

/** OTP_DEBUG_BLK4_W6_REG register
 *  Otp debuger block4 data register6.
 */
#define OTP_DEBUG_BLK4_W6_REG (DR_REG_OTP_DEBUG_BASE + 0xe4)
/** OTP_DEBUG_BLOCK4_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block4 word6 data.
 */
#define OTP_DEBUG_BLOCK4_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W6_M  (OTP_DEBUG_BLOCK4_W6_V << OTP_DEBUG_BLOCK4_W6_S)
#define OTP_DEBUG_BLOCK4_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK4_W6_S  0

