espressif/esp-idf/components/soc/esp32p4/include/soc/otp_debug_reg.h
/** OTP_DEBUG_BLK5_W11_REG register
 *  Otp debuger block5 data register11.
 */
#define OTP_DEBUG_BLK5_W11_REG (DR_REG_OTP_DEBUG_BASE + 0x124)
/** OTP_DEBUG_BLOCK5_W11 : RO; bitpos: [31:0]; default: 0;
 *  Otp block5 word11 data.
 */
#define OTP_DEBUG_BLOCK5_W11    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK5_W11_M  (OTP_DEBUG_BLOCK5_W11_V << OTP_DEBUG_BLOCK5_W11_S)
#define OTP_DEBUG_BLOCK5_W11_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK5_W11_S  0

/** OTP_DEBUG_BLK6_W1_REG register
 *  Otp debuger block6 data register1.
 */
#define OTP_DEBUG_BLK6_W1_REG (DR_REG_OTP_DEBUG_BASE + 0x128)
/** OTP_DEBUG_BLOCK6_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word1 data.
 */
#define OTP_DEBUG_BLOCK6_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W1_M  (OTP_DEBUG_BLOCK6_W1_V << OTP_DEBUG_BLOCK6_W1_S)
#define OTP_DEBUG_BLOCK6_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W1_S  0

/** OTP_DEBUG_BLK6_W2_REG register
 *  Otp debuger block6 data register2.
 */
#define OTP_DEBUG_BLK6_W2_REG (DR_REG_OTP_DEBUG_BASE + 0x12c)
/** OTP_DEBUG_BLOCK6_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word2 data.
 */
#define OTP_DEBUG_BLOCK6_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W2_M  (OTP_DEBUG_BLOCK6_W2_V << OTP_DEBUG_BLOCK6_W2_S)
#define OTP_DEBUG_BLOCK6_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W2_S  0

/** OTP_DEBUG_BLK6_W3_REG register
 *  Otp debuger block6 data register3.
 */
#define OTP_DEBUG_BLK6_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x130)
/** OTP_DEBUG_BLOCK6_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word3 data.
 */
#define OTP_DEBUG_BLOCK6_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W3_M  (OTP_DEBUG_BLOCK6_W3_V << OTP_DEBUG_BLOCK6_W3_S)
#define OTP_DEBUG_BLOCK6_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W3_S  0

/** OTP_DEBUG_BLK6_W4_REG register
 *  Otp debuger block6 data register4.
 */
#define OTP_DEBUG_BLK6_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x134)
/** OTP_DEBUG_BLOCK6_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word4 data.
 */
#define OTP_DEBUG_BLOCK6_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W4_M  (OTP_DEBUG_BLOCK6_W4_V << OTP_DEBUG_BLOCK6_W4_S)
#define OTP_DEBUG_BLOCK6_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W4_S  0

/** OTP_DEBUG_BLK6_W5_REG register
 *  Otp debuger block6 data register5.
 */
#define OTP_DEBUG_BLK6_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x138)
/** OTP_DEBUG_BLOCK6_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word5 data.
 */
#define OTP_DEBUG_BLOCK6_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W5_M  (OTP_DEBUG_BLOCK6_W5_V << OTP_DEBUG_BLOCK6_W5_S)
#define OTP_DEBUG_BLOCK6_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W5_S  0

/** OTP_DEBUG_BLK6_W6_REG register
 *  Otp debuger block6 data register6.
 */
#define OTP_DEBUG_BLK6_W6_REG (DR_REG_OTP_DEBUG_BASE + 0x13c)
/** OTP_DEBUG_BLOCK6_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word6 data.
 */
#define OTP_DEBUG_BLOCK6_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W6_M  (OTP_DEBUG_BLOCK6_W6_V << OTP_DEBUG_BLOCK6_W6_S)
#define OTP_DEBUG_BLOCK6_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W6_S  0

/** OTP_DEBUG_BLK6_W7_REG register
 *  Otp debuger block6 data register7.
 */
#define OTP_DEBUG_BLK6_W7_REG (DR_REG_OTP_DEBUG_BASE + 0x140)
/** OTP_DEBUG_BLOCK6_W7 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word7 data.
 */
#define OTP_DEBUG_BLOCK6_W7    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W7_M  (OTP_DEBUG_BLOCK6_W7_V << OTP_DEBUG_BLOCK6_W7_S)
#define OTP_DEBUG_BLOCK6_W7_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W7_S  0

/** OTP_DEBUG_BLK6_W8_REG register
 *  Otp debuger block6 data register8.
 */
#define OTP_DEBUG_BLK6_W8_REG (DR_REG_OTP_DEBUG_BASE + 0x144)
/** OTP_DEBUG_BLOCK6_W8 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word8 data.
 */
#define OTP_DEBUG_BLOCK6_W8    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W8_M  (OTP_DEBUG_BLOCK6_W8_V << OTP_DEBUG_BLOCK6_W8_S)
#define OTP_DEBUG_BLOCK6_W8_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W8_S  0

/** OTP_DEBUG_BLK6_W9_REG register
 *  Otp debuger block6 data register9.
 */
#define OTP_DEBUG_BLK6_W9_REG (DR_REG_OTP_DEBUG_BASE + 0x148)
/** OTP_DEBUG_BLOCK6_W9 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word9 data.
 */
#define OTP_DEBUG_BLOCK6_W9    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W9_M  (OTP_DEBUG_BLOCK6_W9_V << OTP_DEBUG_BLOCK6_W9_S)
#define OTP_DEBUG_BLOCK6_W9_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W9_S  0

/** OTP_DEBUG_BLK6_W10_REG register
 *  Otp debuger block6 data register10.
 */
#define OTP_DEBUG_BLK6_W10_REG (DR_REG_OTP_DEBUG_BASE + 0x14c)
/** OTP_DEBUG_BLOCK6_W10 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word10 data.
 */
#define OTP_DEBUG_BLOCK6_W10    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W10_M  (OTP_DEBUG_BLOCK6_W10_V << OTP_DEBUG_BLOCK6_W10_S)
#define OTP_DEBUG_BLOCK6_W10_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W10_S  0

/** OTP_DEBUG_BLK6_W11_REG register
 *  Otp debuger block6 data register11.
 */
#define OTP_DEBUG_BLK6_W11_REG (DR_REG_OTP_DEBUG_BASE + 0x150)
/** OTP_DEBUG_BLOCK6_W11 : RO; bitpos: [31:0]; default: 0;
 *  Otp block6 word11 data.
 */
#define OTP_DEBUG_BLOCK6_W11    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W11_M  (OTP_DEBUG_BLOCK6_W11_V << OTP_DEBUG_BLOCK6_W11_S)
#define OTP_DEBUG_BLOCK6_W11_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK6_W11_S  0

/** OTP_DEBUG_BLK7_W1_REG register
 *  Otp debuger block7 data register1.
 */
#define OTP_DEBUG_BLK7_W1_REG (DR_REG_OTP_DEBUG_BASE + 0x154)
/** OTP_DEBUG_BLOCK7_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word1 data.
 */
#define OTP_DEBUG_BLOCK7_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W1_M  (OTP_DEBUG_BLOCK7_W1_V << OTP_DEBUG_BLOCK7_W1_S)
#define OTP_DEBUG_BLOCK7_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W1_S  0

/** OTP_DEBUG_BLK7_W2_REG register
 *  Otp debuger block7 data register2.
 */
#define OTP_DEBUG_BLK7_W2_REG (DR_REG_OTP_DEBUG_BASE + 0x158)
/** OTP_DEBUG_BLOCK7_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word2 data.
 */
#define OTP_DEBUG_BLOCK7_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W2_M  (OTP_DEBUG_BLOCK7_W2_V << OTP_DEBUG_BLOCK7_W2_S)
#define OTP_DEBUG_BLOCK7_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W2_S  0

/** OTP_DEBUG_BLK7_W3_REG register
 *  Otp debuger block7 data register3.
 */
#define OTP_DEBUG_BLK7_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x15c)
/** OTP_DEBUG_BLOCK7_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word3 data.
 */
#define OTP_DEBUG_BLOCK7_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W3_M  (OTP_DEBUG_BLOCK7_W3_V << OTP_DEBUG_BLOCK7_W3_S)
#define OTP_DEBUG_BLOCK7_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W3_S  0

/** OTP_DEBUG_BLK7_W4_REG register
 *  Otp debuger block7 data register4.
 */
#define OTP_DEBUG_BLK7_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x160)
/** OTP_DEBUG_BLOCK7_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word4 data.
 */
#define OTP_DEBUG_BLOCK7_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W4_M  (OTP_DEBUG_BLOCK7_W4_V << OTP_DEBUG_BLOCK7_W4_S)
#define OTP_DEBUG_BLOCK7_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W4_S  0

/** OTP_DEBUG_BLK7_W5_REG register
 *  Otp debuger block7 data register5.
 */
#define OTP_DEBUG_BLK7_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x164)
/** OTP_DEBUG_BLOCK7_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word5 data.
 */
#define OTP_DEBUG_BLOCK7_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W5_M  (OTP_DEBUG_BLOCK7_W5_V << OTP_DEBUG_BLOCK7_W5_S)
#define OTP_DEBUG_BLOCK7_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W5_S  0

/** OTP_DEBUG_BLK7_W6_REG register
 *  Otp debuger block7 data register6.
 */
#define OTP_DEBUG_BLK7_W6_REG (DR_REG_OTP_DEBUG_BASE + 0x168)
/** OTP_DEBUG_BLOCK7_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word6 data.
 */
#define OTP_DEBUG_BLOCK7_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W6_M  (OTP_DEBUG_BLOCK7_W6_V << OTP_DEBUG_BLOCK7_W6_S)
#define OTP_DEBUG_BLOCK7_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W6_S  0

