espressif/esp-idf/components/soc/esp32p4/include/soc/otp_debug_reg.h
/** OTP_DEBUG_BLK7_W7_REG register
 *  Otp debuger block7 data register7.
 */
#define OTP_DEBUG_BLK7_W7_REG (DR_REG_OTP_DEBUG_BASE + 0x16c)
/** OTP_DEBUG_BLOCK7_W7 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word7 data.
 */
#define OTP_DEBUG_BLOCK7_W7    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W7_M  (OTP_DEBUG_BLOCK7_W7_V << OTP_DEBUG_BLOCK7_W7_S)
#define OTP_DEBUG_BLOCK7_W7_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W7_S  0

/** OTP_DEBUG_BLK7_W8_REG register
 *  Otp debuger block7 data register8.
 */
#define OTP_DEBUG_BLK7_W8_REG (DR_REG_OTP_DEBUG_BASE + 0x170)
/** OTP_DEBUG_BLOCK7_W8 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word8 data.
 */
#define OTP_DEBUG_BLOCK7_W8    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W8_M  (OTP_DEBUG_BLOCK7_W8_V << OTP_DEBUG_BLOCK7_W8_S)
#define OTP_DEBUG_BLOCK7_W8_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W8_S  0

/** OTP_DEBUG_BLK7_W9_REG register
 *  Otp debuger block7 data register9.
 */
#define OTP_DEBUG_BLK7_W9_REG (DR_REG_OTP_DEBUG_BASE + 0x174)
/** OTP_DEBUG_BLOCK7_W9 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word9 data.
 */
#define OTP_DEBUG_BLOCK7_W9    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W9_M  (OTP_DEBUG_BLOCK7_W9_V << OTP_DEBUG_BLOCK7_W9_S)
#define OTP_DEBUG_BLOCK7_W9_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W9_S  0

/** OTP_DEBUG_BLK7_W10_REG register
 *  Otp debuger block7 data register10.
 */
#define OTP_DEBUG_BLK7_W10_REG (DR_REG_OTP_DEBUG_BASE + 0x178)
/** OTP_DEBUG_BLOCK7_W10 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word10 data.
 */
#define OTP_DEBUG_BLOCK7_W10    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W10_M  (OTP_DEBUG_BLOCK7_W10_V << OTP_DEBUG_BLOCK7_W10_S)
#define OTP_DEBUG_BLOCK7_W10_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W10_S  0

/** OTP_DEBUG_BLK7_W11_REG register
 *  Otp debuger block7 data register11.
 */
#define OTP_DEBUG_BLK7_W11_REG (DR_REG_OTP_DEBUG_BASE + 0x17c)
/** OTP_DEBUG_BLOCK7_W11 : RO; bitpos: [31:0]; default: 0;
 *  Otp block7 word11 data.
 */
#define OTP_DEBUG_BLOCK7_W11    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W11_M  (OTP_DEBUG_BLOCK7_W11_V << OTP_DEBUG_BLOCK7_W11_S)
#define OTP_DEBUG_BLOCK7_W11_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK7_W11_S  0

/** OTP_DEBUG_BLK8_W1_REG register
 *  Otp debuger block8 data register1.
 */
#define OTP_DEBUG_BLK8_W1_REG (DR_REG_OTP_DEBUG_BASE + 0x180)
/** OTP_DEBUG_BLOCK8_W1 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word1 data.
 */
#define OTP_DEBUG_BLOCK8_W1    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W1_M  (OTP_DEBUG_BLOCK8_W1_V << OTP_DEBUG_BLOCK8_W1_S)
#define OTP_DEBUG_BLOCK8_W1_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W1_S  0

/** OTP_DEBUG_BLK8_W2_REG register
 *  Otp debuger block8 data register2.
 */
#define OTP_DEBUG_BLK8_W2_REG (DR_REG_OTP_DEBUG_BASE + 0x184)
/** OTP_DEBUG_BLOCK8_W2 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word2 data.
 */
#define OTP_DEBUG_BLOCK8_W2    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W2_M  (OTP_DEBUG_BLOCK8_W2_V << OTP_DEBUG_BLOCK8_W2_S)
#define OTP_DEBUG_BLOCK8_W2_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W2_S  0

/** OTP_DEBUG_BLK8_W3_REG register
 *  Otp debuger block8 data register3.
 */
#define OTP_DEBUG_BLK8_W3_REG (DR_REG_OTP_DEBUG_BASE + 0x188)
/** OTP_DEBUG_BLOCK8_W3 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word3 data.
 */
#define OTP_DEBUG_BLOCK8_W3    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W3_M  (OTP_DEBUG_BLOCK8_W3_V << OTP_DEBUG_BLOCK8_W3_S)
#define OTP_DEBUG_BLOCK8_W3_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W3_S  0

/** OTP_DEBUG_BLK8_W4_REG register
 *  Otp debuger block8 data register4.
 */
#define OTP_DEBUG_BLK8_W4_REG (DR_REG_OTP_DEBUG_BASE + 0x18c)
/** OTP_DEBUG_BLOCK8_W4 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word4 data.
 */
#define OTP_DEBUG_BLOCK8_W4    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W4_M  (OTP_DEBUG_BLOCK8_W4_V << OTP_DEBUG_BLOCK8_W4_S)
#define OTP_DEBUG_BLOCK8_W4_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W4_S  0

/** OTP_DEBUG_BLK8_W5_REG register
 *  Otp debuger block8 data register5.
 */
#define OTP_DEBUG_BLK8_W5_REG (DR_REG_OTP_DEBUG_BASE + 0x190)
/** OTP_DEBUG_BLOCK8_W5 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word5 data.
 */
#define OTP_DEBUG_BLOCK8_W5    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W5_M  (OTP_DEBUG_BLOCK8_W5_V << OTP_DEBUG_BLOCK8_W5_S)
#define OTP_DEBUG_BLOCK8_W5_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W5_S  0

/** OTP_DEBUG_BLK8_W6_REG register
 *  Otp debuger block8 data register6.
 */
#define OTP_DEBUG_BLK8_W6_REG (DR_REG_OTP_DEBUG_BASE + 0x194)
/** OTP_DEBUG_BLOCK8_W6 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word6 data.
 */
#define OTP_DEBUG_BLOCK8_W6    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W6_M  (OTP_DEBUG_BLOCK8_W6_V << OTP_DEBUG_BLOCK8_W6_S)
#define OTP_DEBUG_BLOCK8_W6_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W6_S  0

/** OTP_DEBUG_BLK8_W7_REG register
 *  Otp debuger block8 data register7.
 */
#define OTP_DEBUG_BLK8_W7_REG (DR_REG_OTP_DEBUG_BASE + 0x198)
/** OTP_DEBUG_BLOCK8_W7 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word7 data.
 */
#define OTP_DEBUG_BLOCK8_W7    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W7_M  (OTP_DEBUG_BLOCK8_W7_V << OTP_DEBUG_BLOCK8_W7_S)
#define OTP_DEBUG_BLOCK8_W7_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W7_S  0

/** OTP_DEBUG_BLK8_W8_REG register
 *  Otp debuger block8 data register8.
 */
#define OTP_DEBUG_BLK8_W8_REG (DR_REG_OTP_DEBUG_BASE + 0x19c)
/** OTP_DEBUG_BLOCK8_W8 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word8 data.
 */
#define OTP_DEBUG_BLOCK8_W8    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W8_M  (OTP_DEBUG_BLOCK8_W8_V << OTP_DEBUG_BLOCK8_W8_S)
#define OTP_DEBUG_BLOCK8_W8_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W8_S  0

/** OTP_DEBUG_BLK8_W9_REG register
 *  Otp debuger block8 data register9.
 */
#define OTP_DEBUG_BLK8_W9_REG (DR_REG_OTP_DEBUG_BASE + 0x1a0)
/** OTP_DEBUG_BLOCK8_W9 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word9 data.
 */
#define OTP_DEBUG_BLOCK8_W9    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W9_M  (OTP_DEBUG_BLOCK8_W9_V << OTP_DEBUG_BLOCK8_W9_S)
#define OTP_DEBUG_BLOCK8_W9_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W9_S  0

/** OTP_DEBUG_BLK8_W10_REG register
 *  Otp debuger block8 data register10.
 */
#define OTP_DEBUG_BLK8_W10_REG (DR_REG_OTP_DEBUG_BASE + 0x1a4)
/** OTP_DEBUG_BLOCK8_W10 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word10 data.
 */
#define OTP_DEBUG_BLOCK8_W10    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W10_M  (OTP_DEBUG_BLOCK8_W10_V << OTP_DEBUG_BLOCK8_W10_S)
#define OTP_DEBUG_BLOCK8_W10_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W10_S  0

/** OTP_DEBUG_BLK8_W11_REG register
 *  Otp debuger block8 data register11.
 */
#define OTP_DEBUG_BLK8_W11_REG (DR_REG_OTP_DEBUG_BASE + 0x1a8)
/** OTP_DEBUG_BLOCK8_W11 : RO; bitpos: [31:0]; default: 0;
 *  Otp block8 word11 data.
 */
#define OTP_DEBUG_BLOCK8_W11    0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W11_M  (OTP_DEBUG_BLOCK8_W11_V << OTP_DEBUG_BLOCK8_W11_S)
#define OTP_DEBUG_BLOCK8_W11_V  0xFFFFFFFFU
#define OTP_DEBUG_BLOCK8_W11_S  0

